---
kind: other
id: Methods.T:Autodesk.Revit.DB.IExportContext2D
source: html/1275f0ad-ee3c-1074-f880-5519328c93c3.htm
---
# IExportContext2D Methods

This method is called when a Curve is being output.